{ "rpgEncounter": [       
{ 
    "title": "Toilet Issues", 
    "action": "As you are walking through the corridors of Hogwards second floor, a young boy darts out of the bathrooms and bumps into you at full speed. You prepare to start a rant, but before seeing his face he is already running in the other direction.\n **1. Chase that little...**\n**2.Check the bathroom he came from.**\n**3.I was like that on my first year.** ***Walks away.***", 
    "option1": { "chance": 0.4, "reward": { "type": "item", "value": "bertiebotts" }, "successMessage": "You are getting too old for this, as soon as you catch up to the child, you hear a loud explosion coming from the bathroom, the entire place covered in filth. The boy spends the rest of the day cleaning the room, he seems genuinely sorry after the work and even shares with you some treats from his bag. ", "failMessage": "The little brat is almost at your grasp when you slip on a puddle in the corridor floor and fall, right after his escape you discover what the prank was, the whole bathroom filled with an unbearable smell. ***I wonder where a first year learnt aquamenti***", "emoji": "1️⃣" }, 
    "option2": { "chance": 0.7, "reward": { "type": "money", "value": 100 }, "successMessage": "As you enter the room you spot what seems like a particularly big dungbomb on the floor. Luckily you managed to get rid of the thing before it activated. You are rewarded with a bonus that month, for saving that bathroom from a most disreputable end.", "failMessage": "As you enter the toilet your feet stumbles into something, next thing you know you are in a bed at the Hogwarts hospital wing. Some students have found you feinted in the smelly bathroom after stumbling over a dungbomb. The stink still sticks to you.", "emoji": "2️⃣" }, 
    "option3": { "chance": 0.9, "reward": { "type": "nothing" }, "successMessage": "While you walk away you hear a loud sound, it seems the boy had planted a dungbomb on the bathroom. ***I pity the one who will have to clean this mess***.", "failMessage": "While preparing to walk away, you notice the boy has stained your clothes with dirt, you decide to clean it in the bathroom, but as soon as the door opens an extremely stinky smoke hits your nostrils. You walk away coughing and realize that child had placed a dungbomb in the toilet.", "emoji": "3️⃣" }
}
]
}